IDEA StatiCa Open Model
ConnectionCheckRes.CheckResBolt Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of check results for bolts
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<CheckResBolt> CheckResBolt { get; set; }
Public Property CheckResBolt As List(Of CheckResBolt)
	Get
	Set
public:
property List<CheckResBolt^>^ CheckResBolt {
	List<CheckResBolt^>^ get ();
	void set (List<CheckResBolt^>^ value);
}
Property Value
Type: List<CheckResBolt>
See Also
Reference
ConnectionCheckRes Class
IdeaRS.OpenModel.Connection Namespace